blog-posts/2004-07-05-documentary-me-using-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Documentary: me using Emacs? ;)</title>
<!-- 2014-04-30 Wed 17:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Documentary: me using Emacs? ;)</h1>
<p>
July 5th, 2004 -
<a href="http://sachachua.com/blog/p/2156"><a href="http://sachachua.com/blog/p/2156">http://sachachua.com/blog/p/2156</a></a>
</p>

<p>
Andy Sy said:
</p>

<blockquote>
<p>
Is there a film documentary available somewhere showing you how you
 use Emacs? God knows I've tried and tried to get the hang of it and
 still find myself heavily disliking Emacs.
</p>

<p>
I want to visually experience someone else using Emacs to see if it's
 really more efficient to do things like mail, news, web browsing
 (??!? how do you do that without graphics?) in it.
</p>

<p>
I don't see it displacing SciTE as my favorite editor anytime,
 but perhaps Mozilla as my email/news client of choice&#x2026;?
</p>
</blockquote>

<p>
And in another post&#x2026;
</p>

<blockquote>
<p>
More like mind-numbing for me, because there are just too many
keybindings
 to remember and it is so annoying when you get them wrong. Anyway, I
was
 hoping someone would make a film documentary showing Sacha (or some
other
 Emacs guru) doing everday stuff under Emacs, to see how much of a
speed
 and efficiency advantage it has (if any) compared to using say,
Mozilla
 for browsing newsgroups/replying to email, and perhaps SciTE, for
editing
 programs.
</p>
</blockquote>

<p>
E-Mail from Andy Sy
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
